{
  "timestamp": "2026-01-28T09:01:30.800861",
  "sections": {
    "https://blog.bitmex.com/api-change-26-01-2026/": {
      "title": "API Update: Introducing origClOrdID and changing clOrdID in executions",
      "hash": "0ae8b328aa07ed5097726ec2d790c89ad9facfd6a2af38d5edfa5022a4afab06",
      "last_checked": "2026-01-28T09:01:30.801874",
      "content": "API Update: Introducing origClOrdID and changing clOrdID in executions\nMon, 12 Jan 2026 16:00:00 GMT\nhttps://blog.bitmex.com/api-change-26-01-2026/\nAt BitMEX, we are committed to continually improving our platform and its infrastructure to support advanced trading capabilities for our users. As part of this ongoing effort, we are announcing an update to our REST and WebSocket APIs. From 26 January 2026, a new field,  origClOrdId , will be added to the BitMEX Execution response.  Effective Date and Time:  26 January 2026 at 06:00 - 09:00 UTC\n What is changing? A new field,  origClOrdID , will be added to the Execution response (available via the /execution and /order REST API endpoint and WebSocket API).  origClOrdID  will hold the previous  clOrdID  when the order is replaced, otherwise the currently effective  clOrdID . Cancellation responses will also include  origClOrdID  which will always be the currently effective  clOrdID  value. Please refer to a snippet example in the REST API or WebSocket API below: /execution \"execID\":\"2e8f42c4-1b86-291b-c371-87a2c503b1a8\", \"orderID\": \"2e8f42c4-1b86-291b-c371-899999999998\", \"origClOrdID\": \"id1\", \"clOrdID\": \"id2\", \"account\": 1234567, \"symbol\":\"XBTUSDT\",  Additionally the content of  clOrdID   will change in some cases.  clOrdID  will reflect the value of the amend request when rejecting, whereas before it was the current value. In all other cases it stays as it is today, which is the current effective value for the order.   Why are we making this change? We are aligning with common standards, such as FIX, to make it easier to track chains of amends. This is an additive change, meaning it introduces a new field without removing any existing data. Most integrations should be unaffected.  If you have any questions about these upcoming changes, please contact  Support . To be the first to know about our new listings, product launches, giveaways and more, we invite you to join one of our  online communities  and connect with other traders. For the absolute latest, you can also follow us on  Twitter , or read our  blog  and  site announcements .\nAPI"
    },
    "https://blog.bitmex.com/api-change-27-01-2026-01/": {
      "title": "API Update: Introducing the 'minPrice' Field to the Instrument Endpoint",
      "hash": "5ab19b0995ed27e44de05d00a145d98a7eeef2abb9480c8a6520f09dec8ec2cb",
      "last_checked": "2026-01-28T09:01:31.103889",
      "content": "API Update: Introducing the 'minPrice' Field to the Instrument Endpoint\nMon, 19 Jan 2026 16:00:00 GMT\nhttps://blog.bitmex.com/api-change-27-01-2026-01/\nAPI Update: Introducing the 'minPrice' Field to the Instrument Endpoint \nAt BitMEX, we are committed to continually improving our platform and its infrastructure to support advanced trading capabilities for our users. As part of this ongoing effort, we are announcing an update to our REST and WebSocket APIs. From 27 January 2026, a new field,  minPrice , will be added to the BitMEX Instrument table/endpoint.  Effective Date and Time:  27 January 2026 at 06:00 - 09:00 UTC\n What is changing? A new field,  minPrice , will be added to the response of the Instrument table (available via the  /instrument  REST API endpoint and WebSocket API). For all current instruments, this field will be populated with the instrument's  tickSize  value, representing the smallest valid price for that contract. Please refer to a snippet example of instrument in REST API or WebSocket API below: \"symbol\": \"XBTUSD\", \"maxOrderQty\": 10000000, \"minPrice\": 0.1, \"maxPrice\": 1000000.0, \"lotSize\": 100, \"tickSize\": 0.1 Why are we making this change? The addition of the  minPrice  field complements the existing  maxPrice  field, providing a complete price range specification for contracts. This is an additive change, meaning it introduces a new field without removing any existing data. Most integrations should be unaffected.  \n If you have any questions about these upcoming changes, please contact  Support . To be the first to know about our new listings, product launches, giveaways and more, we invite you to join one of our  online communities  and connect with other traders. For the absolute latest, you can also follow us on  Twitter , or read our  blog  and  site announcements .\nAPI"
    },
    "https://blog.bitmex.com/api-change-27-01-2026/": {
      "title": "API Update: Introducing execCommCcy in executions ",
      "hash": "12716e82f5eb3d841a73db0cbaa536e8b637c70acd263e70ee2a9566534d7e9c",
      "last_checked": "2026-01-28T09:01:31.406122",
      "content": "API Update: Introducing execCommCcy in executions \nMon, 19 Jan 2026 16:00:00 GMT\nhttps://blog.bitmex.com/api-change-27-01-2026/\nAt BitMEX, we are committed to continually improving our platform and its infrastructure to support advanced trading capabilities for our users. As part of this ongoing effort, we are announcing an update to our REST and WebSocket APIs. \nFrom 27 January 2026, a new field, execCommCcy, will be added to the BitMEX Execution response.  \n Effective Date and Time:  27 January 2026 at 06:00 - 09:00 UTC\n What is changing? A new field,  execCommCcy , will be added to the Execution response (available via the /execution and /order REST API endpoint and WebSocket API). It will explicitly show the currency the execComm is denominated in. \nPlease refer to a snippet example in the REST API or WebSocket API below: /execution \"execID\":\"2e8f42c4-1b86-291b-c371-87a2c503b1a8\", \"orderID\": \"2e8f42c4-1b86-291b-c371-899999999998\", \"account\": 1234567, \"symbol\":\"XBTUSDT\", \"execComm\":1800, \"execCommCcy\":\"XBt\" \n Why are we making this change? We are adding an explicit field to provide future flexibility for the fee settlement system.  This is an additive change, meaning it introduces a new field without removing any existing data. Most integrations should be unaffected.  \n If you have any questions about these upcoming changes, please contact  Support . To be the first to know about our new listings, product launches, giveaways and more, we invite you to join one of our  online communities  and connect with other traders. For the absolute latest, you can also follow us on  Twitter , or read our  blog  and  site announcements .\nAPI"
    },
    "https://blog.bitmex.com/api-travel-rule/": {
      "title": "BitMEX API Changes for Travel Rule Compliance",
      "hash": "5dfc6518d03bdd24d1aae9965f8bf20d740d84ca5b8e5721baf0a0094f3c37aa",
      "last_checked": "2026-01-28T09:01:31.708181",
      "content": "BitMEX API Changes for Travel Rule Compliance\nSun, 11 Jan 2026 16:00:00 GMT\nhttps://blog.bitmex.com/api-travel-rule/\nThe BitMEX API has been updated to comply with global Travel Rule regulations. These changes will be rolled out early 2026 and affect all API withdrawals.\nAPI"
    }
  }
}